OpenFOAM case folders/Experimental validation/Static drift/FoilShipSharp/T0.22_Fr0.2_alpha5.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-8.837277334689105 -5.3023664008134626 -5.89151822312607)
	(13.255916002033658 -5.3023664008134626 -5.89151822312607)
	(13.255916002033658 5.3023664008134626 -5.89151822312607)
	(-8.837277334689105 5.3023664008134626 -5.89151822312607)
	(-8.837277334689105 -5.3023664008134626 2.356607289250428)
	(13.255916002033658 -5.3023664008134626 2.356607289250428)
	(13.255916002033658 5.3023664008134626 2.356607289250428)
	(-8.837277334689105 5.3023664008134626 2.356607289250428)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (75 36 28) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

