OpenFOAM case folders/Experimental validation/Static drift/FoilShipSharp/T0.22_Fr0.2_alpha5.0/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


forces
{
	type forces;
	libs ( "libforces.so" );
	rho rho;
	log yes;
	writeControl timeStep;
	writeInterval 1;
	patches ( hull deck trailingEdge );
	rhoInf 999.1;
	CofR (0.0 0.0 0.0);
}

forceCoeffs
{
	type forceCoeffs;
	libs ( "libforces.so" );
	log yes;
	writeControl timeStep;
	writeInterval 1;
	rho rho;
	patches ( hull deck trailingEdge );
	rhoInf 999.1;
	CofR (0.0 0.0 0.0);
	liftDir (0 1 0);
	dragDir (1 0 0);
	pitchAxis (0 0 1);
	magUInf 1.3139863012984574;
	lRef 4.4;
	Aref 0.9680000000000002;
}